# Brewfile - Declarative Homebrew dependencies
# Install with: brew bundle install

# ============================================================================
# Core Development Tools
# ============================================================================

brew "git"
brew "gh"
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"

# ============================================================================
# Shell & Terminal
# ============================================================================

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "starship"
brew "tmux"
brew "neovim"

cask "ghostty"

# ============================================================================
# Modern CLI Tools
# ============================================================================

brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "tldr"
brew "jq"
brew "zoxide"
brew "httpie"
brew "lazygit"
brew "dust"
brew "htop"
brew "btop"
brew "ranger"
brew "git-delta"

# ============================================================================
# Fonts
# ============================================================================

cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
